OF4.0/tutorials/laminarBedLoad/Coulomb/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
	alpha1
    	{
		field alpha.sand;
		expression "0.55*0.5*(1.0+tanh((pos().y-0.035)/(0.03-pos().y)*10.0))";
                keepPatches 1;
	}
	alpha2
        {
                field alpha.sand;
                expression "0.55";
                condition "pos().y < 0.03";
		keepPatches 1;
        }

	alpha3
    	{
		field alpha.water;
		expression "1.0 - 0.55*0.5*(1.0+tanh((pos().y-0.035)/(0.03-pos().y)*10.0))";
                keepPatches 1;
	}
	alpha4
        {
                field alpha.water;
                expression "0.45";
                condition "pos().y < 0.03";
		keepPatches 1;
        }
 );

// ************************************************************************* //
